[
  {
    "id": "M001",
    "title": "Midnight at Orchard",
    "year": 1994,
    "genres": [
      "Drama",
      "Music"
    ],
    "synopsis": "In a family-run hotel, Eli is a burnt-out paramedic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Eli gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Eli teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Eli must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"Midnight at Orchard\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "culinary",
      "dance",
      "festival",
      "first-contact",
      "hopeful",
      "music-driven",
      "redemption",
      "underdog"
    ]
  },
  {
    "id": "M002",
    "title": "Restless Signals",
    "year": 1988,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a night train across continents, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Restless Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "locked-room",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M003",
    "title": "A Keepsake Called Asha",
    "year": 1995,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a bustling megacity, Priya is a competitive fencer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Priya gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Priya teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Priya must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"A Keepsake Called Asha\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "coming-of-age",
      "high-stakes",
      "library",
      "locked-room",
      "mystery-box",
      "whodunit"
    ]
  },
  {
    "id": "M004",
    "title": "Hidden Signals",
    "year": 2021,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a vintage bookstore, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Hidden Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "heist",
      "hopeful",
      "mentor-student",
      "music-driven",
      "small-town",
      "survival",
      "time-loop",
      "train-journey",
      "underdog"
    ]
  },
  {
    "id": "M005",
    "title": "Midnight at Lab",
    "year": 2010,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a desert research outpost, Sana is a marine biologist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Sana gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Sana teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Sana must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Midnight at Lab\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "science",
      "second-chance",
      "space",
      "time-loop",
      "travel"
    ]
  },
  {
    "id": "M006",
    "title": "A Passage Called Eli",
    "year": 2009,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a traveling circus troupe, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"A Passage Called Eli\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "archival",
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M007",
    "title": "The Golden Alibi",
    "year": 2015,
    "genres": [
      "Comedy",
      "Drama",
      "Romance"
    ],
    "synopsis": "In a national park ranger station, Eli is a burnt-out paramedic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Eli gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Eli teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Eli must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With comedy warmth and drama momentum, \"The Golden Alibi\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "clever-twists",
      "culinary",
      "ensemble-cast",
      "fish-out-of-water",
      "second-chance",
      "slow-burn",
      "time-loop",
      "unlikely-duo",
      "witty"
    ]
  },
  {
    "id": "M008",
    "title": "The Chord Between Us",
    "year": 1996,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a crumbling art museum, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"The Chord Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "archival",
      "city-life",
      "cozy",
      "identity",
      "museum",
      "small-town",
      "train-journey",
      "underdog"
    ]
  },
  {
    "id": "M009",
    "title": "Midnight at Ballroom",
    "year": 1989,
    "genres": [
      "Drama",
      "Sport",
      "Sci-Fi"
    ],
    "synopsis": "In a desert research outpost, Eli is a burnt-out paramedic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Eli gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Eli teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Eli must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Midnight at Ballroom\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "bittersweet",
      "championship",
      "exploration",
      "mentor-student",
      "road-trip",
      "science",
      "self-discovery",
      "space",
      "underdog"
    ]
  },
  {
    "id": "M010",
    "title": "The Golden Signal",
    "year": 2017,
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "synopsis": "In a remote island, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"The Golden Signal\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "bittersweet",
      "exploration",
      "magical-realism",
      "mountains",
      "mythic-quest",
      "self-discovery",
      "space",
      "travel"
    ]
  },
  {
    "id": "M011",
    "title": "Canyon After Midnight",
    "year": 2006,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a family-run hotel, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Canyon After Midnight\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "courtroom",
      "exploration",
      "hopeful",
      "science",
      "space",
      "startup",
      "travel"
    ]
  },
  {
    "id": "M012",
    "title": "Paper Crescendos",
    "year": 2013,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a national park ranger station, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"Paper Crescendos\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "championship",
      "found-family",
      "hopeful",
      "road-trip",
      "time-loop",
      "train-journey",
      "underdog",
      "unlikely-duo"
    ]
  },
  {
    "id": "M013",
    "title": "Midnight at Arcade",
    "year": 2008,
    "genres": [
      "Adventure",
      "Fantasy",
      "Sport"
    ],
    "synopsis": "In a space station in orbit, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Midnight at Arcade\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "championship",
      "exploration",
      "magical-realism",
      "mentor-student",
      "mythic-quest",
      "self-discovery",
      "travel",
      "underdog"
    ]
  },
  {
    "id": "M014",
    "title": "The Strange Echo",
    "year": 2003,
    "genres": [
      "Drama",
      "Sport",
      "Music"
    ],
    "synopsis": "In a university campus, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"The Strange Echo\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "dance",
      "festival",
      "library",
      "mentor-student",
      "music-driven",
      "noir",
      "time-loop",
      "underdog"
    ]
  },
  {
    "id": "M015",
    "title": "Midnight at Harbor",
    "year": 1997,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a floating market district, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Midnight at Harbor\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "coming-of-age",
      "cozy",
      "desert",
      "high-stakes",
      "second-chance",
      "survival",
      "workplace"
    ]
  },
  {
    "id": "M016",
    "title": "A Compass Called Eli",
    "year": 2019,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a remote island, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"A Compass Called Eli\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "science",
      "space",
      "travel",
      "witty"
    ]
  },
  {
    "id": "M017",
    "title": "Rewiringing Orchard",
    "year": 2020,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a floating market district, Rina is a fearless investigative podcaster who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Rina gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Rina teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Rina must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Rewiringing Orchard\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "museum",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M018",
    "title": "The Strange Alibi",
    "year": 2011,
    "genres": [
      "Drama",
      "Music",
      "Adventure"
    ],
    "synopsis": "In a remote island, Priya is a competitive fencer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Priya gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Priya teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Priya must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"The Strange Alibi\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "dance",
      "exploration",
      "festival",
      "music-driven",
      "science",
      "space",
      "train-journey",
      "travel"
    ]
  },
  {
    "id": "M019",
    "title": "The Lucky Riddle",
    "year": 1998,
    "genres": [
      "Family",
      "Animation",
      "Music"
    ],
    "synopsis": "In an underground jazz club, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"The Lucky Riddle\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "dance",
      "festival",
      "found-family",
      "hopeful",
      "journalism",
      "music-driven",
      "redemption",
      "rivalry"
    ]
  },
  {
    "id": "M020",
    "title": "Paper Riddles",
    "year": 2007,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a national park ranger station, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"Paper Riddles\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "first-contact",
      "found-family",
      "hopeful",
      "locked-room",
      "museum",
      "music-driven",
      "rags-to-riches",
      "slow-burn"
    ]
  },
  {
    "id": "M021",
    "title": "Paper Chords",
    "year": 2005,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a space station in orbit, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Paper Chords\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "clever-twists",
      "fish-out-of-water",
      "high-stakes",
      "journalism",
      "mockumentary",
      "museum",
      "second-chance",
      "sports-team"
    ]
  },
  {
    "id": "M022",
    "title": "The Keepsake Between Us",
    "year": 2016,
    "genres": [
      "Comedy",
      "Drama"
    ],
    "synopsis": "In a national park ranger station, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With comedy warmth and drama momentum, \"The Keepsake Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cozy",
      "ensemble-cast",
      "fish-out-of-water",
      "high-stakes",
      "hopeful",
      "identity",
      "science",
      "survival",
      "time-loop",
      "witty"
    ]
  },
  {
    "id": "M023",
    "title": "Library After Midnight",
    "year": 2022,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a stormy lighthouse, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Library After Midnight\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "courtroom",
      "heist",
      "high-stakes",
      "journalism",
      "magical-realism",
      "noir"
    ]
  },
  {
    "id": "M024",
    "title": "Blueprint of Canyon",
    "year": 2014,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In an underground jazz club, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Blueprint of Canyon\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "family-secrets",
      "high-stakes",
      "locked-room",
      "museum",
      "mystery-box",
      "mythic-quest",
      "redemption",
      "whodunit"
    ]
  },
  {
    "id": "M025",
    "title": "Paper Paradoxs",
    "year": 2004,
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "synopsis": "In a film festival circuit, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Paper Paradoxs\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "city-life",
      "con-artist",
      "cozy",
      "dance",
      "exploration",
      "magical-realism",
      "mythic-quest",
      "travel"
    ]
  },
  {
    "id": "M026",
    "title": "Library After Summer",
    "year": 2001,
    "genres": [
      "Drama",
      "History",
      "Sci-Fi"
    ],
    "synopsis": "In a community radio station, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Library After Summer\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "archival",
      "coming-of-age",
      "courtroom",
      "exploration",
      "friends-to-lovers",
      "science",
      "space",
      "sports-team"
    ]
  },
  {
    "id": "M027",
    "title": "A Riddle Called Asha",
    "year": 2024,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a night train across continents, Rina is a fearless investigative podcaster who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Rina gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Rina teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Rina must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"A Riddle Called Asha\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "locked-room",
      "redemption",
      "second-chance",
      "slow-burn",
      "space",
      "witty"
    ]
  },
  {
    "id": "M028",
    "title": "Lantern of Canyon",
    "year": 2018,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a night train across continents, Rina is a fearless investigative podcaster who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Rina gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Rina teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Rina must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Lantern of Canyon\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "cozy",
      "festival",
      "mentor-student",
      "rivalry",
      "road-trip",
      "underdog",
      "unlikely-duo",
      "workplace"
    ]
  },
  {
    "id": "M029",
    "title": "Echo of Backroad",
    "year": 1987,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a film festival circuit, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Echo of Backroad\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "culinary",
      "heist",
      "high-stakes",
      "noir",
      "robot-companion",
      "time-loop"
    ]
  },
  {
    "id": "M030",
    "title": "The Last Cipher",
    "year": 1985,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a family-run hotel, Rina is a fearless investigative podcaster who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Rina gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Rina teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Rina must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"The Last Cipher\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "desert",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "robot-companion",
      "whodunit"
    ]
  },
  {
    "id": "M031",
    "title": "Dante's Keepsake",
    "year": 2023,
    "genres": [
      "Comedy",
      "Drama"
    ],
    "synopsis": "In a space station in orbit, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With comedy warmth and drama momentum, \"Dante's Keepsake\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "con-artist",
      "ensemble-cast",
      "fish-out-of-water",
      "identity",
      "locked-room",
      "music-driven",
      "rivalry",
      "space",
      "witty"
    ]
  },
  {
    "id": "M032",
    "title": "Strange Signals",
    "year": 2012,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a tech startup incubator, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Strange Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "cozy",
      "library",
      "mentor-student",
      "mythic-quest",
      "underdog",
      "whodunit"
    ]
  },
  {
    "id": "M033",
    "title": "The Unseen Signal",
    "year": 1990,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a tech startup incubator, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"The Unseen Signal\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "city-life",
      "cozy",
      "festival",
      "journalism",
      "mythic-quest",
      "noir",
      "redemption",
      "whodunit"
    ]
  },
  {
    "id": "M034",
    "title": "Museum After Tomorrow",
    "year": 1991,
    "genres": [
      "Drama",
      "Sport",
      "Mystery"
    ],
    "synopsis": "In a remote island, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Museum After Tomorrow\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "championship",
      "locked-room",
      "mentor-student",
      "mystery-box",
      "rags-to-riches",
      "robot-companion",
      "underdog",
      "whodunit"
    ]
  },
  {
    "id": "M035",
    "title": "Findinging Harbor",
    "year": 1993,
    "genres": [
      "Crime",
      "Thriller",
      "Mystery"
    ],
    "synopsis": "In a bustling megacity, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Findinging Harbor\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "noir",
      "whodunit"
    ]
  },
  {
    "id": "M036",
    "title": "Gentle Signals",
    "year": 1999,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a bustling megacity, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Gentle Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "city-life",
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "mythic-quest",
      "robot-companion",
      "science",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M037",
    "title": "The Paradox Between Us",
    "year": 2000,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a stormy lighthouse, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"The Paradox Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "coming-of-age",
      "con-artist",
      "heist",
      "high-stakes",
      "noir",
      "redemption"
    ]
  },
  {
    "id": "M038",
    "title": "The Gentle Map",
    "year": 2002,
    "genres": [
      "Mystery",
      "Thriller",
      "Crime"
    ],
    "synopsis": "In a tech startup incubator, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"The Gentle Map\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "noir",
      "second-chance",
      "whodunit"
    ]
  },
  {
    "id": "M039",
    "title": "A Cipher Called Asha",
    "year": 1986,
    "genres": [
      "Drama",
      "Sport",
      "Adventure"
    ],
    "synopsis": "In a floating market district, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"A Cipher Called Asha\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "archival",
      "championship",
      "exploration",
      "mentor-student",
      "ocean",
      "robot-companion",
      "time-loop",
      "travel",
      "underdog"
    ]
  },
  {
    "id": "M040",
    "title": "A Riddle Called Noor",
    "year": 1992,
    "genres": [
      "Drama",
      "Sport",
      "History"
    ],
    "synopsis": "In a stormy lighthouse, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"A Riddle Called Noor\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "championship",
      "hopeful",
      "magical-realism",
      "mentor-student",
      "mountains",
      "ocean",
      "travel",
      "underdog"
    ]
  },
  {
    "id": "M041",
    "title": "Hector's Blueprint",
    "year": 1994,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a vintage bookstore, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Hector's Blueprint\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "high-stakes",
      "identity",
      "locked-room",
      "mystery-box",
      "noir",
      "travel",
      "whodunit"
    ]
  },
  {
    "id": "M042",
    "title": "Borrowinging Seaport",
    "year": 1988,
    "genres": [
      "Romance",
      "Comedy",
      "Crime"
    ],
    "synopsis": "In a stormy lighthouse, Priya is a competitive fencer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Priya gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Priya teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Priya must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Borrowinging Seaport\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "con-artist",
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "heist",
      "mockumentary",
      "noir",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M043",
    "title": "The Silver Paradox",
    "year": 1995,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a deep-sea habitat, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"The Silver Paradox\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "city-life",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "mythic-quest",
      "noir"
    ]
  },
  {
    "id": "M044",
    "title": "Paper Promises",
    "year": 2021,
    "genres": [
      "Adventure",
      "Fantasy",
      "Action"
    ],
    "synopsis": "In a traveling circus troupe, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Paper Promises\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "dance",
      "ensemble-cast",
      "exploration",
      "magical-realism",
      "mythic-quest",
      "travel",
      "unlikely-duo"
    ]
  },
  {
    "id": "M045",
    "title": "Rooftop After Summer",
    "year": 2010,
    "genres": [
      "Drama",
      "Music"
    ],
    "synopsis": "In a tech startup incubator, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"Rooftop After Summer\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "bittersweet",
      "championship",
      "clever-twists",
      "cozy",
      "dance",
      "festival",
      "music-driven",
      "train-journey"
    ]
  },
  {
    "id": "M046",
    "title": "The Promise Between Us",
    "year": 2009,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a family-run hotel, Sana is a marine biologist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Sana gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Sana teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Sana must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"The Promise Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ensemble-cast",
      "fish-out-of-water",
      "found-family",
      "friends-to-lovers",
      "identity",
      "library",
      "second-chance",
      "slow-burn",
      "train-journey",
      "witty"
    ]
  },
  {
    "id": "M047",
    "title": "A Signal Called Priya",
    "year": 2015,
    "genres": [
      "Sci-Fi",
      "Adventure",
      "History"
    ],
    "synopsis": "In a desert research outpost, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"A Signal Called Priya\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "mystery-box",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M048",
    "title": "Sketchinging Skyline",
    "year": 1996,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a film festival circuit, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"Sketchinging Skyline\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "found-family",
      "high-stakes",
      "hopeful",
      "identity",
      "mentor-student",
      "museum",
      "redemption",
      "time-loop"
    ]
  },
  {
    "id": "M049",
    "title": "Midnight at Canyon",
    "year": 1989,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a deep-sea habitat, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Midnight at Canyon\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "courtroom",
      "journalism",
      "mentor-student",
      "rags-to-riches",
      "second-chance",
      "train-journey",
      "underdog",
      "whodunit",
      "witty"
    ]
  },
  {
    "id": "M050",
    "title": "Lab After Tomorrow",
    "year": 2017,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a bustling megacity, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Lab After Tomorrow\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "clever-twists",
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "mockumentary",
      "mystery-box",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M051",
    "title": "Tomas's Passage",
    "year": 2006,
    "genres": [
      "Crime",
      "Thriller",
      "Fantasy"
    ],
    "synopsis": "In a tech startup incubator, Priya is a competitive fencer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Priya gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Priya teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Priya must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Tomas's Passage\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "magical-realism",
      "mythic-quest",
      "noir"
    ]
  },
  {
    "id": "M052",
    "title": "Observatory After Summer",
    "year": 2013,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a vintage bookstore, Eli is a burnt-out paramedic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Eli gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Eli teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Eli must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Observatory After Summer\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "bittersweet",
      "cat-and-mouse",
      "clever-twists",
      "courtroom",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "small-town",
      "sports-team",
      "whodunit"
    ]
  },
  {
    "id": "M053",
    "title": "Paper Orbits",
    "year": 2008,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In an underground jazz club, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Paper Orbits\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "city-life",
      "clever-twists",
      "ensemble-cast",
      "fish-out-of-water",
      "found-family",
      "friends-to-lovers",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M054",
    "title": "Paper Stitchs",
    "year": 2003,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a tech startup incubator, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Paper Stitchs\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "bittersweet",
      "championship",
      "dance",
      "desert",
      "mentor-student",
      "museum",
      "noir",
      "sports-team",
      "underdog",
      "whodunit"
    ]
  },
  {
    "id": "M055",
    "title": "Silver Signals",
    "year": 1997,
    "genres": [
      "Adventure",
      "Fantasy",
      "Comedy"
    ],
    "synopsis": "In a space station in orbit, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Silver Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "ensemble-cast",
      "exploration",
      "fish-out-of-water",
      "magical-realism",
      "mythic-quest",
      "travel",
      "witty"
    ]
  },
  {
    "id": "M056",
    "title": "Library After Rain",
    "year": 2019,
    "genres": [
      "Drama",
      "History",
      "Adventure"
    ],
    "synopsis": "In a floating market district, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Library After Rain\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "archival",
      "clever-twists",
      "exploration",
      "friends-to-lovers",
      "redemption",
      "travel",
      "whodunit"
    ]
  },
  {
    "id": "M057",
    "title": "The Passage Between Us",
    "year": 2020,
    "genres": [
      "Family",
      "Animation",
      "Music"
    ],
    "synopsis": "In a crumbling art museum, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"The Passage Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "dance",
      "exploration",
      "festival",
      "found-family",
      "hopeful",
      "mentor-student",
      "music-driven",
      "science",
      "small-town"
    ]
  },
  {
    "id": "M058",
    "title": "The Stitch Between Us",
    "year": 2011,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a mountain town, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"The Stitch Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "identity",
      "mystery-box",
      "mythic-quest",
      "rivalry",
      "second-chance",
      "slow-burn",
      "witty"
    ]
  },
  {
    "id": "M059",
    "title": "Electric Signals",
    "year": 1998,
    "genres": [
      "Comedy",
      "Drama"
    ],
    "synopsis": "In a vintage bookstore, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With comedy warmth and drama momentum, \"Electric Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ensemble-cast",
      "fish-out-of-water",
      "journalism",
      "locked-room",
      "mockumentary",
      "mystery-box",
      "ocean",
      "witty",
      "workplace"
    ]
  },
  {
    "id": "M060",
    "title": "Lucky Signals",
    "year": 2007,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a desert research outpost, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Lucky Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "clever-twists",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "mythic-quest",
      "redemption",
      "whodunit"
    ]
  },
  {
    "id": "M061",
    "title": "The Compass Between Us",
    "year": 2005,
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "synopsis": "In a national park ranger station, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a partner who insists on doing things the hard way, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"The Compass Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "desert",
      "exploration",
      "magical-realism",
      "mythic-quest",
      "noir",
      "travel",
      "whodunit"
    ]
  },
  {
    "id": "M062",
    "title": "A Mirage Called Hector",
    "year": 2016,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a floating market district, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"A Mirage Called Hector\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "courtroom",
      "exploration",
      "fish-out-of-water",
      "found-family",
      "hopeful",
      "identity",
      "mentor-student",
      "mystery-box",
      "robot-companion",
      "time-loop"
    ]
  },
  {
    "id": "M063",
    "title": "Midnight at Station",
    "year": 2022,
    "genres": [
      "Romance",
      "Comedy",
      "War"
    ],
    "synopsis": "In a tech startup incubator, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Midnight at Station\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "music-driven",
      "second-chance",
      "slow-burn",
      "travel",
      "witty"
    ]
  },
  {
    "id": "M064",
    "title": "Midnight at Avenue",
    "year": 2014,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a bustling megacity, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"Midnight at Avenue\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "clever-twists",
      "ensemble-cast",
      "found-family",
      "hopeful",
      "music-driven",
      "second-chance",
      "slow-burn",
      "small-town",
      "travel"
    ]
  },
  {
    "id": "M065",
    "title": "Mira's Lantern",
    "year": 2004,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In an underground jazz club, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Mira's Lantern\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "championship",
      "desert",
      "hopeful",
      "identity",
      "journalism",
      "mentor-student",
      "second-chance",
      "time-loop"
    ]
  },
  {
    "id": "M066",
    "title": "Skyline After Dawn",
    "year": 2001,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a university campus, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to pull off a clean, victimless heist.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Skyline After Dawn\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "bittersweet",
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "noir",
      "workplace"
    ]
  },
  {
    "id": "M067",
    "title": "The Unseen Map",
    "year": 2024,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a national park ranger station, Sana is a marine biologist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Sana gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Sana teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Sana must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"The Unseen Map\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "dance",
      "high-stakes",
      "identity",
      "locked-room",
      "mystery-box",
      "unlikely-duo",
      "whodunit"
    ]
  },
  {
    "id": "M068",
    "title": "Mira's Passage",
    "year": 2018,
    "genres": [
      "Family",
      "Animation"
    ],
    "synopsis": "In a bustling megacity, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With family warmth and animation momentum, \"Mira's Passage\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "championship",
      "courtroom",
      "dance",
      "found-family",
      "hopeful",
      "museum",
      "robot-companion",
      "self-discovery"
    ]
  },
  {
    "id": "M069",
    "title": "The Quiet Passage",
    "year": 1987,
    "genres": [
      "Drama",
      "Music"
    ],
    "synopsis": "In an underground jazz club, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"The Quiet Passage\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "courtroom",
      "culinary",
      "dance",
      "festival",
      "high-stakes",
      "music-driven",
      "noir",
      "road-trip",
      "self-discovery"
    ]
  },
  {
    "id": "M070",
    "title": "The Mirage Between Us",
    "year": 1985,
    "genres": [
      "Sci-Fi",
      "Adventure",
      "Crime"
    ],
    "synopsis": "In a national park ranger station, Sana is a marine biologist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Sana gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Sana teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Sana must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"The Mirage Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "con-artist",
      "exploration",
      "heist",
      "hopeful",
      "noir",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M071",
    "title": "The Silver Mirage",
    "year": 2023,
    "genres": [
      "Adventure",
      "Fantasy",
      "Music"
    ],
    "synopsis": "In a traveling circus troupe, Eli is a burnt-out paramedic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Eli gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Eli teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Eli must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"The Silver Mirage\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "dance",
      "exploration",
      "festival",
      "magical-realism",
      "music-driven",
      "mythic-quest",
      "travel"
    ]
  },
  {
    "id": "M072",
    "title": "Noor's Crescendo",
    "year": 2012,
    "genres": [
      "Drama",
      "Music",
      "Adventure"
    ],
    "synopsis": "In a deep-sea habitat, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"Noor's Crescendo\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "clever-twists",
      "courtroom",
      "cozy",
      "dance",
      "exploration",
      "festival",
      "music-driven",
      "travel"
    ]
  },
  {
    "id": "M073",
    "title": "Midnight at Seaport",
    "year": 1990,
    "genres": [
      "Mystery",
      "Thriller",
      "Music"
    ],
    "synopsis": "In a film festival circuit, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Midnight at Seaport\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "dance",
      "festival",
      "high-stakes",
      "locked-room",
      "music-driven",
      "mystery-box",
      "whodunit"
    ]
  },
  {
    "id": "M074",
    "title": "A Riddle Called Jules",
    "year": 1991,
    "genres": [
      "Drama",
      "History",
      "War"
    ],
    "synopsis": "In a night train across continents, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"A Riddle Called Jules\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "desert",
      "heist",
      "hopeful",
      "museum",
      "rivalry",
      "second-chance",
      "travel"
    ]
  },
  {
    "id": "M075",
    "title": "Stitch of Orchard",
    "year": 1993,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a mountain town, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Stitch of Orchard\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "clever-twists",
      "mentor-student",
      "mountains",
      "science",
      "second-chance",
      "self-discovery",
      "underdog"
    ]
  },
  {
    "id": "M076",
    "title": "Lantern of Harbor",
    "year": 1999,
    "genres": [
      "Drama",
      "Sport"
    ],
    "synopsis": "In a stormy lighthouse, Leah is a gifted pastry chef who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Leah gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Leah teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Leah must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and sport momentum, \"Lantern of Harbor\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "championship",
      "fish-out-of-water",
      "friends-to-lovers",
      "mentor-student",
      "mockumentary",
      "road-trip",
      "robot-companion",
      "science",
      "slow-burn",
      "underdog"
    ]
  },
  {
    "id": "M077",
    "title": "Rewiringing Canyon",
    "year": 2000,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a community radio station, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Rewiringing Canyon\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "archival",
      "championship",
      "courtroom",
      "found-family",
      "friends-to-lovers",
      "mythic-quest",
      "science",
      "workplace"
    ]
  },
  {
    "id": "M078",
    "title": "The Hidden Cipher",
    "year": 2002,
    "genres": [
      "Sci-Fi",
      "Adventure",
      "Music"
    ],
    "synopsis": "In a space station in orbit, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"The Hidden Cipher\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "dance",
      "exploration",
      "festival",
      "hopeful",
      "music-driven",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M079",
    "title": "The Borrowed Paradox",
    "year": 1986,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a university campus, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"The Borrowed Paradox\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "first-contact",
      "found-family",
      "high-stakes",
      "journalism",
      "locked-room",
      "mystery-box",
      "unlikely-duo",
      "whodunit"
    ]
  },
  {
    "id": "M080",
    "title": "Orbit of Lab",
    "year": 1992,
    "genres": [
      "Drama",
      "Music"
    ],
    "synopsis": "In a family-run hotel, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"Orbit of Lab\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "dance",
      "ensemble-cast",
      "festival",
      "hopeful",
      "locked-room",
      "music-driven",
      "rivalry",
      "robot-companion",
      "startup"
    ]
  },
  {
    "id": "M081",
    "title": "The Borrowed Orbit",
    "year": 1994,
    "genres": [
      "Drama",
      "History",
      "Comedy"
    ],
    "synopsis": "In a community radio station, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"The Borrowed Orbit\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "ensemble-cast",
      "family-secrets",
      "fish-out-of-water",
      "locked-room",
      "rags-to-riches",
      "rivalry",
      "witty"
    ]
  },
  {
    "id": "M082",
    "title": "The Alibi Between Us",
    "year": 1988,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In an underground jazz club, Mira is a meticulous archivist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Mira gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Mira teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Mira must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"The Alibi Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "courtroom",
      "exploration",
      "found-family",
      "hopeful",
      "noir",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M083",
    "title": "Jules's Alibi",
    "year": 1995,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In a traveling circus troupe, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to reunite an estranged family.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: two seemingly separate stories are actually the same incident. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Jules's Alibi\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "clever-twists",
      "friends-to-lovers",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "spacewalk",
      "whodunit"
    ]
  },
  {
    "id": "M084",
    "title": "Paper Blueprints",
    "year": 2021,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a university campus, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Paper Blueprints\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "championship",
      "clever-twists",
      "con-artist",
      "dance",
      "museum",
      "redemption",
      "space"
    ]
  },
  {
    "id": "M085",
    "title": "A Map Called Asha",
    "year": 2010,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a desert research outpost, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"A Map Called Asha\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "clever-twists",
      "journalism",
      "library",
      "locked-room",
      "magical-realism",
      "mentor-student",
      "noir",
      "underdog"
    ]
  },
  {
    "id": "M086",
    "title": "The Cipher Between Us",
    "year": 2009,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In an underground jazz club, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a glitchy AI assistant with too much personality, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"The Cipher Between Us\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "exploration",
      "fish-out-of-water",
      "identity",
      "mountains",
      "music-driven",
      "small-town",
      "spacewalk",
      "startup",
      "time-loop"
    ]
  },
  {
    "id": "M087",
    "title": "The Silver Archive",
    "year": 2015,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a deep-sea habitat, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face an anonymous tip that keeps changing, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"The Silver Archive\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "archival",
      "cozy",
      "found-family",
      "heist",
      "hopeful",
      "locked-room",
      "redemption",
      "sports-team"
    ]
  },
  {
    "id": "M088",
    "title": "Borrowed Signals",
    "year": 1996,
    "genres": [
      "Comedy",
      "Drama",
      "Mystery"
    ],
    "synopsis": "In a bustling megacity, Noor is an ambitious robotics engineer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Noor gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Noor teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Noor must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With comedy warmth and drama momentum, \"Borrowed Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "coming-of-age",
      "ensemble-cast",
      "fish-out-of-water",
      "locked-room",
      "mystery-box",
      "robot-companion",
      "whodunit",
      "witty"
    ]
  },
  {
    "id": "M089",
    "title": "Dante's Alibi",
    "year": 1989,
    "genres": [
      "Drama",
      "Music"
    ],
    "synopsis": "In a desert research outpost, Tomas is a quiet amateur astronomer who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Tomas gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Tomas teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Tomas must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and music momentum, \"Dante's Alibi\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "dance",
      "festival",
      "heist",
      "mockumentary",
      "music-driven",
      "road-trip",
      "sports-team",
      "train-journey"
    ]
  },
  {
    "id": "M090",
    "title": "Midnight at Museum",
    "year": 2017,
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "synopsis": "In an underground jazz club, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a contract clause that threatens everything, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With mystery warmth and thriller momentum, \"Midnight at Museum\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "championship",
      "clever-twists",
      "high-stakes",
      "locked-room",
      "mystery-box",
      "sports-team",
      "survival",
      "whodunit"
    ]
  },
  {
    "id": "M091",
    "title": "Compass of Avenue",
    "year": 2006,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a coastal city, Hector is a night-shift security guard who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Hector gets one chance to set it right—and to save a community landmark from closure.\n\nTo do it, Hector teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the missing piece is hidden in plain sight in a mundane object. Hector must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Compass of Avenue\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "locked-room",
      "noir",
      "travel"
    ]
  },
  {
    "id": "M092",
    "title": "Avenue After Dawn",
    "year": 2013,
    "genres": [
      "Adventure",
      "Fantasy",
      "Crime"
    ],
    "synopsis": "In a vintage bookstore, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to uncover the truth behind a viral hoax.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Avenue After Dawn\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "con-artist",
      "exploration",
      "heist",
      "magical-realism",
      "mythic-quest",
      "noir",
      "travel"
    ]
  },
  {
    "id": "M093",
    "title": "Sana's Keepsake",
    "year": 2008,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a traveling circus troupe, Rina is a fearless investigative podcaster who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Rina gets one chance to set it right—and to restore a lost work of art.\n\nTo do it, Rina teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the ‘villain’ turns out to be protecting someone vulnerable. Rina must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Sana's Keepsake\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "clever-twists",
      "cozy",
      "exploration",
      "hopeful",
      "science",
      "space",
      "travel"
    ]
  },
  {
    "id": "M094",
    "title": "Midnight at Library",
    "year": 2003,
    "genres": [
      "Drama",
      "History"
    ],
    "synopsis": "In a stormy lighthouse, Owen is a documentary filmmaker who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Owen gets one chance to set it right—and to finish a project before an impossible deadline.\n\nTo do it, Owen teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face their own fear of being seen and judged, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Owen must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With drama warmth and history momentum, \"Midnight at Library\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "archival",
      "con-artist",
      "fish-out-of-water",
      "high-stakes",
      "mountains",
      "noir",
      "ocean"
    ]
  },
  {
    "id": "M095",
    "title": "Postcard of Ballroom",
    "year": 1997,
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "synopsis": "In a national park ranger station, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to win a once-in-a-lifetime grant.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a ticking clock tied to a public event, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the truth is smaller, sadder, and more human than expected. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With adventure warmth and fantasy momentum, \"Postcard of Ballroom\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "ancient-ruins",
      "city-life",
      "exploration",
      "magical-realism",
      "mythic-quest",
      "ocean",
      "slow-burn",
      "travel"
    ]
  },
  {
    "id": "M096",
    "title": "Bright Signals",
    "year": 2019,
    "genres": [
      "Romance",
      "Comedy"
    ],
    "synopsis": "In a night train across continents, Dante is a rookie public defender who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Dante gets one chance to set it right—and to prove a scientific theory under pressure.\n\nTo do it, Dante teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a storm that cuts off all escape routes, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Dante must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With romance warmth and comedy momentum, \"Bright Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "culinary",
      "ensemble-cast",
      "fish-out-of-water",
      "friends-to-lovers",
      "mythic-quest",
      "second-chance",
      "slow-burn",
      "small-town",
      "witty"
    ]
  },
  {
    "id": "M097",
    "title": "Midnight at Rooftop",
    "year": 2020,
    "genres": [
      "Crime",
      "Thriller"
    ],
    "synopsis": "In a floating market district, Asha is a practical event planner who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Asha gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Asha teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the clue everyone chased was planted years ago. Asha must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"Midnight at Rooftop\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "festival",
      "heist",
      "high-stakes",
      "noir",
      "self-discovery",
      "startup"
    ]
  },
  {
    "id": "M098",
    "title": "A Keepsake Called Priya",
    "year": 2011,
    "genres": [
      "Crime",
      "Thriller",
      "Fantasy"
    ],
    "synopsis": "In a national park ranger station, Jules is a struggling stand-up comic who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Jules gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Jules teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a rival who knows their weak spots, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the protagonist’s plan works—but costs them their old life. Jules must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With crime warmth and thriller momentum, \"A Keepsake Called Priya\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "cat-and-mouse",
      "clever-twists",
      "con-artist",
      "heist",
      "high-stakes",
      "magical-realism",
      "mythic-quest",
      "noir",
      "small-town"
    ]
  },
  {
    "id": "M099",
    "title": "Quiet Signals",
    "year": 1998,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a tech startup incubator, Cal is a reformed con artist who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Cal gets one chance to set it right—and to solve a decades-old disappearance.\n\nTo do it, Cal teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a secret history buried in public records, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the confidant has been writing the narrative for their own reasons. Cal must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Quiet Signals\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "exploration",
      "hopeful",
      "science",
      "self-discovery",
      "space",
      "travel"
    ]
  },
  {
    "id": "M100",
    "title": "Orchard After Winter",
    "year": 2007,
    "genres": [
      "Sci-Fi",
      "Adventure"
    ],
    "synopsis": "In a remote island, Lin is a street musician who thinks life can be managed with lists and late nights. When a small mistake snowballs into a public problem, Lin gets one chance to set it right—and to clear a loved one’s name.\n\nTo do it, Lin teams up with an unlikely ally whose style is the opposite of careful planning. Together they follow a trail of messages, favors, and half-remembered stories that pull them through street corners, back rooms, and unexpected kindness. The deeper they go, the more they face a mistaken identity that spirals, and the more their initial assumptions about what ‘success’ means begin to crack.\n\nAs the deadline closes in, a final reveal changes the shape of the mystery: the final obstacle becomes an unexpected act of kindness. Lin must choose between a neat ending and a brave one, learning to ask for help and to trust their own instincts. With sci-fi warmth and adventure momentum, \"Orchard After Winter\" lands on a hopeful note that lingers after the credits.",
    "tags": [
      "AI",
      "ancient-ruins",
      "championship",
      "exploration",
      "hopeful",
      "science",
      "space",
      "startup",
      "travel"
    ]
  }
]